Revit 2026 API

# ExportPDFSettingsFindByName Method

---

Returns settings element by name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ExportPDFSettings FindByName(
	Document document,
	string name
)
```
```vb
Public Shared Function FindByName (
	document As Document,
	name As String
) As ExportPDFSettings
```
```cpp
public:
static ExportPDFSettings^ FindByName(
	Document^ document,
	String^ name
)
```
```fsharp
static member FindByName :
        document : Document *
        name : string -> ExportPDFSettings
```

#### Parameters

document Document
     The document to find the settings with the specified name.
name String
     Name of the settings to find.

#### Return Value

ExportPDFSettings The settings element, or  if not found.

| Exception | Condition |
| --- | --- |
| ArgumentException | name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportPDFSettings Class

Autodesk.Revit.DB Namespace